[{"title":"Conservation Membership Officer (Fundraiser) Bandung Area","type":"Full time","category":"5fcd13f2bcddd42f71ad3978","is_vocational":false,"salary":{"min":null,"max":null,"type":null,"currency":null},"qualification":"<ul>\n\t<li>Lulusan Diploma / Sarjana dari segala jurusan.</li>\n\t<li>Memiliki kemampuan komunikasi yang baik.</li>\n\t<li>Memiliki kepribadian positif dan menyenangkan.</li>\n\t<li>Memiliki perhatian terhadap kelestarian alam Indonesia.</li>\n\t<li>Maksimal Usia 30 tahun.</li>\n\t<li>Berdomisili di Bandung.</li>\n</ul>","description":"<p><strong>Tanggung Jawab:</strong></p>\n\n<ol>\n\t<li>Mengenalkan program konservansi alam indonesia yang sudah dan akan dilakukan oleh Yayasan Konservasi Alam Nusantara kepada masyarakat umum.</li>\n\t<li>Mengajak masyarakat umum untuk membantu alam indonesia dengan menjadi member (donatur).</li>\n</ol>\n\n<p><strong>Benefit:</strong></p>\n\n<ol>\n\t<li>Berkesempatan untuk berkarir di organisasi berskala internasional.</li>\n\t<li>Pendapatan yang atraktif (income + insentif = Rp. 3.500.000,- s/d Rp. 10.000.000,-) <em>based on performance</em>.</li>\n\t<li>Mengikuti program pelatihan dan pengembangan manajemen.</li>\n\t<li>Berkontribusi dalam memastikan alam Indonesia dan keragaman hayati yang berada didalamnya terlindungi untuk memberi manfaat bagi generasi sekarang dan generasi yang akan datang.</li>\n\t<li>Membantu banyak komunitas untuk hidup lebih baik lagi.</li>\n</ol>","job_source":"kalibrr","job_url":"https://kalibrr.id/c/the-nature-conservancy-indonesia/jobs/122501/conservation-membership-officer-fundraiser-bandung-area","company":{"name":"Yayasan Konservasi Alam Nusantara","description":"Yayasan Konservasi Alam Nusantara (YKAN) is a local affiliate of The Nature Conservancy. We seeks to improve welfare in Indonesia without compromising the sustainability of natural resources for present and future generations by promoting the value of nature, accelerating the transformation in conservation and utilization of natural resources in a sustainable manner through a series of protected area management, conservation of important species, and community empowerment.\n\nOur Mission\nOur mission is to conserve the lands and waters on which all life depends. Together, we promote the value of nature and catalyze transformational change in conservation and sustainable use of natural resources for the benefit of people and nature.\n\nOur Vision\nOur vision is to leave a sustainable world for future generations. A prosperous Indonesia where the needs of people and the sustainability of nature are in balance for today’s and future generations.\n\nWHY you need to join with us:\n\nA commitment to respect, integrity, diversity and lasting results. As indispensable to The Nature Conservancy’s success as our unifying mission, vision, goals and measures are our unique values—the distinguishing attributes that characterize how we conduct ourselves in our drive for tangible, lasting results. These attributes are not mere platitudes but deeply held convictions universally manifested by all who represent our organization. \n\nIntegrity Beyond Reproach\n\nWe will meet the highest ethical and professional standards in all of our organizational endeavors and, in doing so, we hold ourselves accountable to our mission and to the public\n\nRespect for People, Communities, and Cultures\n\nEnduring conservation success depends on the active involvement of people and partners whose lives and livelihoods are linked to the natural systems we seek to conserve. We respect the needs, values and traditions of local communities and cultures, and we forge relationships based on mutual benefit and trust.\n\nCommitment to Diversity\n\nWe recognize that biological diversity conservation is best advanced by the leadership and contributions of men and women of diverse backgrounds, beliefs and cultures. We will recruit and mentor staff to create an inclusive organization that reflects our global character.\n\nOne Conservancy\n\nOur strength and vitality lie in being one organization working together in local places and across borders to achieve our global mission. We value the collective and collaborative efforts that are so essential to our success.\n\nTangible, Lasting Results\n\nOur mission of preserving biological diversity guides everything we do. We use the best available science, a creative spirit, and a non-confrontational approach to craft innovative solutions to complex conservation problems at scales that matter and in ways that will endure.","website":"https://www.ykan.or.id/","logo":"https://rec-data.kalibrr.com/www.kalibrr.id/logos/23LMAMQ63UJG24UBWB87JDHMJXZFQJHTH5UHQVYU-5edefb3e.png"},"tags":[],"location":"5fcd2399a9754be177689021"},{"title":"Junior Service Engineer (Bandung Area)","type":"Contractual","category":"5fcd11c6a9754be17768901e","is_vocational":false,"salary":{"min":null,"max":5000000,"type":null,"currency":null},"qualification":"<ul>\n\t<li>Candidate must possess at least a Bachelor's Degree from Computer Science/Information Technology, Engineering (Electrical/Electronic), or equivalent with minimum GPA 3.00/4.00</li>\n\t<li>Able to work on shifting working model</li>\n\t<li>Willing to work overtime</li>\n\t<li>Willing to work on holiday / Sunday / Saturday</li>\n\t<li>Discipline with time management</li>\n\t<li>Willing to be asigned on Remote area</li>\n\t<li>Good attitude and having a good teamwork</li>\n\t<li>Strong analytical skills</li>\n\t<li>Ability to solve problems</li>\n\t<li>Able to operate MS Office</li>\n</ul>","description":"<p>A service engineer is responsible for supporting equipment in a Microsoft Windows environment, from design through implementation and support. A System Engineer performs a wide variety of installation, configuration and upgrading of workstations, servers and related hardware and software in a LAN, WAN and stand-alone environment. Maintenance and solve problem and installation machines IBM Product (Series, pSeries).</p>","job_source":"kalibrr","job_url":"https://kalibrr.id/c/pt-jasa-teknologi-informasi-ibm/jobs/153195/junior-service-engineer-bandung-area","company":{"name":"PT. Jasa Teknologi Informasi IBM","description":"Was founded in 2003, supporting IBM in providing skilled resources to install - move - add -change (IMAC), and to perform other activities that relates to after sales support for IBM products in Indonesia.\n\nTo support the Strategic Objectives of IBM Indonesia in providing comprehensive end-to-end IT solutions for the community, in July 2010 IBM-JTI was transformed, re-shaping its missions, and strengthening the company with new Organizations structure, including the establishment of Business Development function that will focus in developing Solutions that will address the needs of comprehensive IT solutions of the Clients in the market.Today, IBM-JTI provides Total solution services, from IT Infrastructure aspect: Hardware and Software, to the Business aspect, which includes not only IBM Products but also other leading non IBM Products. IBM-JTI will propose the best available solutions that meet Clients needs and requirements regardless the Brand of the Products.\n\nAs an IBM company, we embrace IBM Values and Business Conduct Guidelines. IBM-JTI aims to build the company into a well established and respectable Indonesia company with a strong management team by continuing strive for excellence and commitment to quality, providing effective and efficient Solution to Clients, contributing to the country in creating job opportunities and transfer of advanced technology.","website":"https://www.ibm-jti.com/","logo":"https://rec-data.kalibrr.com/logos/AV55CRAW4T88TLTFLTMGHYUCGEZKALT8YMRP7DND-5c931c96.jpg"},"tags":["Computer Networking","Windows Server","Linux","Computer Hardware Troubleshooting"],"location":"5fcd2399a9754be177689021"},{"title":".Net Developer (Bandung Based)","type":"Full time","category":"5fcd11c6a9754be17768901e","is_vocational":false,"salary":{"min":null,"max":null,"type":null,"currency":null},"qualification":"<ul>\n\t<li class=\"text-justify\">Candidate must possess at least Diploma, Bachelor's Degree in <strong>Computer Science/Information Technology</strong> or equivalent</li>\n\t<li class=\"text-justify\">Experience using <strong>.NET framework C# programming</strong> language for both web based or desktop environment</li>\n\t<li class=\"text-justify\">Strong hands on experience in Microsoft .NET programming (C#, VB .NET, ASP .NET)</li>\n\t<li>Have knowledge Microsoft technology ( SQL )</li>\n\t<li>Knowledge web services or wcf service</li>\n\t<li>Knowledge web APIs</li>\n\t<li>Experience in web based application development</li>\n\t<li>Exp use ajaxjquery/others framework</li>\n\t<li class=\"text-justify\">Passionate to learn, creative, high integrity, hardworking, self-motivated, good interpersonal skill, good team player</li>\n\t<li class=\"text-justify\">Willing to be based in Bandung area</li>\n</ul>","description":"<ul>\n\t<li>Create and develop application</li>\n\t<li>Bug fixing</li>\n\t<li>Testing application</li>\n</ul>","job_source":"kalibrr","job_url":"https://kalibrr.id/c/emerio/jobs/86993/net-developer-bandung-based","company":{"name":"NTT INDONESIA DIGITAL BUSINESS SOLUTIONS","description":"NTT Digital Business Solutions offers digital business expertise and capabilities. As a recognized global outsourcing leader, we provide our clients with adaptable, innovative solutions, partnering with them on their digital transformation journey. Through our modern delivery centers, we serve small, medium and large enterprises in the public and private sectors, across industries. Our high-performing teams, broad industry knowledge, extensive partnerships and proven Quality Management System have earned us a successful track record. \n\nNTT Ltd. is a leading global technology services company. We partner with organizations around the world to shape and achieve outcomes through intelligent technology solutions. For us, intelligent means data driven, connected, digital and secure. \n\nAs a global ICT provider, we employ more than 40,000 people in a diverse and dynamic workplace that spans 57 countries, trading in 73 countries and delivering services in over 200 countries and regions. Together we enable the connected future.\n\nVisit us at: www.emeriocorp.com or hello.global.ntt\n","website":"https://www.emeriocorp.com/","logo":"https://rec-data.kalibrr.com/www.kalibrr.id/logos/8UWWKF4Q5EAHPVWZJUGM6TR86VKSRB6N96328BLC-5d931ed8.jpg"},"tags":[],"location":"5fcd2399a9754be177689021"},{"title":"City Seller Performance Bandung","type":"Contractual","category":"5fcd13f2bcddd42f71ad3978","is_vocational":false,"salary":{"min":null,"max":null,"type":null,"currency":null},"qualification":"<ul>\n\t<li>1-2 years of experience in client-facing role, i.e sales/account handler</li>\n\t<li>Good knowledge of Bandung area;</li>\n\t<li>Fresh entry are welcome to apply;</li>\n\t<li>Excellent communication and presentation skills;</li>\n\t<li>Strong analytical and planning skills</li>\n</ul>\n\n<p> </p>","description":"<ul>\n\t<li>As a part of the Tokopedia expansion team, you will be responsible to :</li>\n\t<li>Improve existing partners performance to reach their full potential</li>\n\t<li>Develop campaign assets focusing on existing sellers performance</li>\n\t<li>Collaborate with MKT marketing team to give more exposures on mid-level partners</li>\n\t<li>Analyze existing partners performance and proposing solutions to improve their performance</li>\n</ul>","job_source":"kalibrr","job_url":"https://kalibrr.id/c/tokopedia/jobs/163250/city-seller-performance-bandung","company":{"name":"Tokopedia","description":"Tokopedia is an Indonesian technology company with a mission to democratize commerce through technology. We are the leading marketplace in Indonesia; we encourage millions of merchants and consumers to participate in the future of commerce.\n\nOur vision is to build an ecosystem where everyone can start and discover anything with ease.\n\nWe are holding to these three principles that drive us forward. We call them our DNA, the traits that embody who we are as Tokopedia Nakama: <b> Focus on Consumer, Growth Mindset, and Make it Happen, Make it Better </b>","website":"https://www.tokopedia.com/","logo":"https://rec-data.kalibrr.com/logos/K25VBH4E4B6BA4HCW6UPYEGPFCS8P3RZTQ6KJBWQ-5bcd893c.jpg"},"tags":[],"location":"5fcd2399a9754be177689021"},{"title":"Partime Barista- Bandung","type":"Part time","category":null,"is_vocational":true,"salary":{"min":null,"max":null,"type":null,"currency":null},"qualification":"<ul>\n\t<li>Single</li>\n\t<li>Maksimal berusia 25 tahun</li>\n\t<li>Memiliki pengalaman F&amp;B minimal 1 tahun lebih disukai</li>\n\t<li>Nilai plus bila bisa berbahasa Inggris</li>\n\t<li>Menyukai kopi</li>\n\t<li>Sehat jasmani dan rohani</li>\n\t<li>Bersedia bekerja dengan sistem shift dan saat public holiday</li>\n</ul>","description":"<ul>\n\t<li>Melayani Customer</li>\n\t<li>Bertanggungjawab terhadap pelayanan produk, mulai dari pembuatan hingga penyajian</li>\n\t<li>Memastikan kebersihan area kerja</li>\n</ul>","job_source":"kalibrr","job_url":"https://kalibrr.id/c/fore-coffee/jobs/165188/partime-barista-bandung","company":{"name":"Fore Coffee","description":"Established in 2018, Fore Coffee is a passionate coffee startups aiming to brew the best specialty coffee for our customer. As our name derived from the word forest, we aim to grow fast, strong, tall and bring life to our surrounding. We want our existence to increase coffee quality for our community by mobile application for ordering and inform you all Information about Fore Coffee.\n\nLeveraging network and experience, we are using the latest tech for our tools and bean blend. Directly from the selected farmer, high-quality beans are processed and roasted to perfection by ourselves then passed on to our skilled barista, excitedly prepare the cup of happiness to be served to you especially.","website":"https://fore.coffee/","logo":"https://rec-data.kalibrr.com/www.kalibrr.com/logos/ESTFE8JPZDL7HTBUFJ2GTXPCY2YLTAHEXQK8DX8H-5e534902.jpg"},"tags":[],"location":"5fcd2399a9754be177689021"},{"title":"Store Unit Manager for Otten Bandung","type":"Full time","category":"5fcd13f2bcddd42f71ad3978","is_vocational":false,"salary":{"min":null,"max":null,"type":null,"currency":null},"qualification":"<p>We are looking a Store Manager with strong value of</p>\n\n<ul>\n\t<li>Integrity</li>\n\t<li>Smart</li>\n\t<li>Give the best</li>\n\t<li>Discipline</li>\n</ul>","description":"<p>1. Drive the sales and increasing commercial margins</p>\n\n<ul>\n\t<li>Daily, weekly and monthly action plan to deliver the expected sales result</li>\n\t<li>Maximize profitability through plans, budgets, and cost follow up</li>\n\t<li>Analize sales person &amp; execute the main sales initiative of the brand</li>\n</ul>\n\n<p>2. Achieve high quality service standards</p>\n\n<ul>\n\t<li>Work with team to give the best for customer to provide exellence service experience</li>\n</ul>\n\n<p>3. Ensure of all company SOP's are implemented well in store</p>\n\n<p>4. Maintain Storage and Inventory</p>\n\n<p>5. Provide continuous learning to all team Sales on selling skills, product knowledge, Costumer service, etc. to ensure high level of competency</p>\n\n<p>6. Improve staff work standard and attitude leading to positive &amp; dynamic</p>","job_source":"kalibrr","job_url":"https://kalibrr.id/c/otten-coffee/jobs/162020/store-unit-manager-for-otten-bandung","company":{"name":"Otten Coffee","description":"We: \n\nA company that began with a passion for coffee and strive to spread the passion to everyone. \n","website":"https://ottencoffee.co.id/","logo":"https://rec-data.kalibrr.com/www.kalibrr.com/logos/36JSM9MN2N3WSMZJLVAL3FFD4YEB3KFX8869KTTM-5d198b9b.png"},"tags":[],"location":"5fcd2399a9754be177689021"},{"title":"Relationship Manager Business Banking - Bandung","type":"Full time","category":"5fcd13f2bcddd42f71ad3978","is_vocational":false,"salary":{"min":null,"max":null,"type":null,"currency":null},"qualification":"<p>Job Requirements</p>\n\n<ul>\n\t<li>Maximal age 35</li>\n\t<li>Minimum S1 of any discipline, preferably from reputable university</li>\n\t<li>Business background with minimal 2 year experience in SME Banking</li>\n\t<li>Good knowledge of banking</li>\n\t<li>Good interpersonal, relationship and communication skills</li>\n\t<li>Good at presentating/selling</li>\n\t<li>Confident with strong business acumen, analytical ability and problem solving skills</li>\n\t<li>Persistence in pursuing business opportunities.</li>\n</ul>","description":"<p>Responsible for achieving objectives by:</p>\n\n<ul>\n\t<li>Acquiring new SME (Business Banking) customers</li>\n\t<li>Maintaining, growing, and deepening relationship with exisitng and prospective such customers</li>\n\t<li>Identifying  customer needs for transaction solutions</li>\n\t<li>Play the role of customer business partner, providing advice on suitable alternative solutions  and customer service</li>\n\t<li>Delivering quality lendings, monitoring loan performance</li>\n\t<li>Complying with prevailing regulation</li>\n</ul>","job_source":"kalibrr","job_url":"https://kalibrr.id/c/permata-bank/jobs/164805/relationship-manager-business-banking-bandung","company":{"name":"Permata Bank","description":"PermataBank was formed by a merger of five banks under the oversight of IBRA (Indonesian Banking Restructuring Agency), i.e. PT Bank Bali Tbk, PT Bank Universal Tbk, PT Bank Prima Express, PT Bank Artamedia, and PT Bank Patriot in 2002. In 2004, Standard Chartered Bank and PT Astra International Tbk took over PermataBank and started a major transformation of the organization. Subsequently, as a manifestation of their commitment to PermataBank, these major shareholders increased their joint ownership to 89.12% since 2006 until now.\n\nThe unique combination of our strategic shareholders has become one of our core strengths. PT Astra International Tbk is one of the biggest Indonesian conglomeration company in Indonesia with extensive experience in the domestic market, while Standard Chartered Bank is a well-respected international bank with market leading expertise and global experience.\n\nPermataBank today has grown into a major private bank offering innovative products and services that can provide comprehensive financial services in a simple, fast, and reliable manner. As a pioneer in mobile banking and mobile cash technology in the Indonesian market, in 2017, PermataBank took a lead in innovation through the launch of the first E-Bond product on the market and was the first bank to introduce TouchID & FaceID in PermataMobile Banking.\n\nServing more than 2 million customers in 62 cities in Indonesia, per December 2018 the Bank has 323 branches (sharia & conventional branches), 16 Mobile Branches, 23 one-stop Sharia service, two Payment Point, 1.018 ATM with additional access at more than 100.000 ATMs (VisaPlus, Visa Electron, MasterCard, Alto, ATM Bersama and ATM Prima) and millions of ATMs around the world that are connected to the network Visa, Mastercard, Cirrus.\n\nThe recognition of recent achievements of PermataBank are, among others, CSR Recognition in Education from Sindo Media (Jan 2018); \"Exceptional Grade\" from the Carre Center for Customer Satisfaction and Loyalty (Carre - CCSL) Award 2018 for, among others, Regular Banking, Credit Card Regular, Platinum Card, Priority Banking dan Sharia Banking (Apr 2018); 13 awards from Banking Service Excellence Award 2018 (Jun 2018), for, among others, Rank #3 Best Overall Performance and rank #1 Best Opening Account Website Application (General category); Rank #1 Best Overall Performance and Best Customer Service (Bank syariah category) and 1 Golden Trophy for the Best Sharia Banking for maintaining the 'Best Overall Performance' title since 2011; \"The Best Frictionless Internet Banking Initiative, Application or Programme\" dari The Asian Banker - Indonesia Country Award 2018 (Ags 2018); 5 Gold Awards for category Best Event Press / Media, Best Event Consumer, Best Event Digital Integration, Best Event Ambience, Best Event Product Launch / Relaunch and 1 Silver Award for category Best Event Multi Channel from The Marketing Events Award for PermataMe #CountMEin campaign (Sept 2018).\n\nPT. Bank Permata Tbk obtained the license as the commercial bank under The Decree of Minister of Finance Number 1937/U.M.II dated 19 February 1957.","website":"https://www.permatabank.com/","logo":"https://rec-data.kalibrr.com/logos/TEGVPZGQFAY93GA5FRUU4V3K35TWQZ2GXLYQPAUT-5c63e5a5.jpg"},"tags":[],"location":"5fcd2399a9754be177689021"},{"title":"AO QR (Bandung)","type":"Contractual","category":"5fcd13f2bcddd42f71ad3978","is_vocational":true,"salary":{"min":null,"max":null,"type":null,"currency":null},"qualification":"<ul>\n\t<li>Minimal SMA/D3 usia 18-30 tahun</li>\n\t<li>Berintegritas, memiliki komunikasi yang baik, ulet dan bertanggung jawab</li>\n\t<li>Berorientasi pada target</li>\n\t<li>Memahami potensi market di area penempatan</li>\n\t<li>mampu menggunakan gadget dan produk digital lainnya</li>\n\t<li>Memiliki pengalaman bekerja sebagai marketing minimal 1 tahun</li>\n</ul>\n\n<p> </p>","description":"<ul>\n\t<li>Melakukan akuisisi new merchant QR</li>\n\t<li>Melakukan maintenance pada existing merchant QR</li>\n\t<li>Memastikan merchant aktif menggunakan QR PermataBank sebagai metode pembayaran kepada customer</li>\n\t<li>Melakukan cross selling produk PermataBank</li>\n</ul>\n\n<p> \n</p><p> </p>\n<p></p>","job_source":"kalibrr","job_url":"https://kalibrr.id/c/permata-bank/jobs/161742/ao-qr-bandung","company":{"name":"Permata Bank","description":"PermataBank was formed by a merger of five banks under the oversight of IBRA (Indonesian Banking Restructuring Agency), i.e. PT Bank Bali Tbk, PT Bank Universal Tbk, PT Bank Prima Express, PT Bank Artamedia, and PT Bank Patriot in 2002. In 2004, Standard Chartered Bank and PT Astra International Tbk took over PermataBank and started a major transformation of the organization. Subsequently, as a manifestation of their commitment to PermataBank, these major shareholders increased their joint ownership to 89.12% since 2006 until now.\n\nThe unique combination of our strategic shareholders has become one of our core strengths. PT Astra International Tbk is one of the biggest Indonesian conglomeration company in Indonesia with extensive experience in the domestic market, while Standard Chartered Bank is a well-respected international bank with market leading expertise and global experience.\n\nPermataBank today has grown into a major private bank offering innovative products and services that can provide comprehensive financial services in a simple, fast, and reliable manner. As a pioneer in mobile banking and mobile cash technology in the Indonesian market, in 2017, PermataBank took a lead in innovation through the launch of the first E-Bond product on the market and was the first bank to introduce TouchID & FaceID in PermataMobile Banking.\n\nServing more than 2 million customers in 62 cities in Indonesia, per December 2018 the Bank has 323 branches (sharia & conventional branches), 16 Mobile Branches, 23 one-stop Sharia service, two Payment Point, 1.018 ATM with additional access at more than 100.000 ATMs (VisaPlus, Visa Electron, MasterCard, Alto, ATM Bersama and ATM Prima) and millions of ATMs around the world that are connected to the network Visa, Mastercard, Cirrus.\n\nThe recognition of recent achievements of PermataBank are, among others, CSR Recognition in Education from Sindo Media (Jan 2018); \"Exceptional Grade\" from the Carre Center for Customer Satisfaction and Loyalty (Carre - CCSL) Award 2018 for, among others, Regular Banking, Credit Card Regular, Platinum Card, Priority Banking dan Sharia Banking (Apr 2018); 13 awards from Banking Service Excellence Award 2018 (Jun 2018), for, among others, Rank #3 Best Overall Performance and rank #1 Best Opening Account Website Application (General category); Rank #1 Best Overall Performance and Best Customer Service (Bank syariah category) and 1 Golden Trophy for the Best Sharia Banking for maintaining the 'Best Overall Performance' title since 2011; \"The Best Frictionless Internet Banking Initiative, Application or Programme\" dari The Asian Banker - Indonesia Country Award 2018 (Ags 2018); 5 Gold Awards for category Best Event Press / Media, Best Event Consumer, Best Event Digital Integration, Best Event Ambience, Best Event Product Launch / Relaunch and 1 Silver Award for category Best Event Multi Channel from The Marketing Events Award for PermataMe #CountMEin campaign (Sept 2018).\n\nPT. Bank Permata Tbk obtained the license as the commercial bank under The Decree of Minister of Finance Number 1937/U.M.II dated 19 February 1957.","website":"https://www.permatabank.com/","logo":"https://rec-data.kalibrr.com/logos/TEGVPZGQFAY93GA5FRUU4V3K35TWQZ2GXLYQPAUT-5c63e5a5.jpg"},"tags":[],"location":"5fcd2399a9754be177689021"},{"title":"Banking Staff - Region 6/Jawa 1","type":"Full time","category":null,"is_vocational":false,"salary":{"min":null,"max":null,"type":null,"currency":null},"qualification":"<ol>\n\t<li>\n\t<p>Minimum Diploma Degree-3 (D3) with minimum of 2.75 from relevant fields of studies</p>\n\t</li>\n\t<li>\n\t<p>Maximum age:</p>\n\n\t<ul>\n\t\t<li>\n\t\t<p>24 years old for fresh graduates and</p>\n\t\t</li>\n\t\t<li>\n\t\t<p>26 years old for with 2 years relevant experience</p>\n\t\t</li>\n\t</ul>\n\t</li>\n\t<li>\n\t<p>Remain unmarried for fresh graduates</p>\n\t</li>\n\t<li>\n\t<p>Presentable and good communication skills</p>\n\t</li>\n</ol>","description":"<p>As a leading bank in Indonesia with aspirations to be the best bank in ASEAN by 2020, we invite highly talented and driven individuals across a wide area of expertise to fill in key positions in the bank. Challenge your abilities and further develop your skills at Mandiri, be a part of the journey to be the best bank in ASEAN by 2020 and get involved in prospering the nation</p>\n\n<p>Key Job Responsibilities will include:</p>\n\n<ul>\n\t<li>Day-to-day office management</li>\n\t<li>Maintain administrative tasks such as filing and processing documents</li>\n\t<li>Perform ad-hoc administrative support functions / office management tasks</li>\n\t<li>Perform data management to support business unit operations</li>\n</ul>","job_source":"kalibrr","job_url":"https://kalibrr.id/c/pt-bank-mandiri-persero-tbk/jobs/108297/banking-staff-region-6-jawa-1","company":{"name":"PT Bank Mandiri (Persero) Tbk.","description":"Bank Mandiri was established on 2 October 1998, as part of the bank restructuring program of the Government of Indonesia. In July 1999, four state-owned banks - Bank Bumi Daya, Bank Dagang Negara, Bank Exim and Bapindo - were amalgamated into Bank Mandiri. The history of these four banks can be traced back to over 140 years, and together they had contributed to the beginning of the Indonesian banking sector.\n\nWe are continuously seeking mutually beneficial business opportunities that create synergies, building alliances and strengthening our supporting businesses with and through our subsidiaries, notably Mandiri Sekuritas in investment banking, AXA Mandiri Financial Services in insurance, Bank Syariah Mandiri in Sharia banking, Bank Sinar Harapan Bali in micro banking, and Mandiri Tunas Finance in multi-finance. In 2011, Bank Mandiri acquired Mandiri AXA General Insurance (MAGI), a joint-venture between Bank Mandiri and AXA Societe Anonyme, to strengthen Bank Mandiri's penetration into the general insurance business. With various subsidiaries that support our businesses, we have further strengthened our position as a prominent financial holdings institution in Indonesia.\n\n“Bank Mandiri continues to realize its commitment to human resource development through the company's work culture program, especially in this new normal era. As a result, this consistency encouraged HR Asia to win Bank Mandiri to become one of the Best Companies to Work For in 2020,” -HR Asia 2020-\n\nBank Mandiri awarded by Digital Marketing & Human Capital Awards 2020 for category The Best Overall for Corporate in Human Capital 2020 (Wholesale Banking Segment) and The Best Chief Human Capital Officer 2020 (Wholesale Banking Segment).","website":"http://www.bankmandiri.co.id/","logo":"https://rec-data.kalibrr.com/logos/VMQVWXPLJCR5XBSVLCR6TWQ8WGZ87VDZRPZQLCEE-5a4da1cb.jpg"},"tags":["Clerical Skills","Interpersonal Skills","Microsoft / MS Office"],"location":"5fcd2399a9754be177689021"},{"title":"Site Manager Bandung","type":"Full time","category":null,"is_vocational":false,"salary":{"min":null,"max":null,"type":null,"currency":null},"qualification":"<ul>\n\t<li>At least a Bachelor's  Degree from any major</li>\n\t<li>Have at least 3-year experience in leading a team</li>\n\t<li>Familiar with using MS. Office</li>\n\t<li>Have leadership skills, honest, perseverance, and able to work under pressure</li>\n\t<li>Proficient in English</li>\n\t<li>Will be placed in Bandung</li>\n\t<li>Willing to follow the training program in Bekasi</li>\n\t<li>Have a personal laptop</li>\n\t<li>Have an active driving license (SIM) A</li>\n</ul>","description":"<ol>\n\t<li>Make plans for resources necessity in the branch's operation</li>\n\t<li>Be in charge of all the operational activies</li>\n\t<li>Be in charge of the company's target sales achievement</li>\n\t<li>Be responsible for the company's administration</li>\n\t<li>Ensure the conformity of the branch's operational budget allocation</li>\n\t<li>Make operational and financial report of the branch company</li>\n\t<li>Maintain Waste4Change's good reputation at the branch</li>\n</ol>","job_source":"kalibrr","job_url":"https://kalibrr.id/c/waste4change-1/jobs/165267/site-manager-bandung-2","company":{"name":"Waste4Change","description":"PT Wasteforchange Alam Indonesia is a company that provides waste management service from upstream to downstream with a vision of reducing the amount of waste that ends up in landfills.","website":"https://waste4change.com/official/","logo":"https://rec-data.kalibrr.com/www.kalibrr.com/logos/KBM8JQKYV99H9FUHDMM32UE3X2F3QVETLNLW852C-5fbe2353.png"},"tags":["Operations Management","Critical Thinking","Leadership skills"],"location":"5fcd2399a9754be177689021"},{"title":"Kriya Mandiri Region 6/Jawa 1","type":"Full time","category":null,"is_vocational":true,"salary":{"min":null,"max":null,"type":null,"currency":null},"qualification":"<ul>\n\t<li>Minimum high school graduate, with a minimum 6.5 average on the national test score</li>\n\t<li>Maximum age of 24 years old</li>\n\t<li>Remain unmarried during internship period</li>\n\t<li>Presentable and good communication skill</li>\n</ul>","description":"<p>Mandiri Kriya is a program where we invite high school graduates to intern at all of Bank Mandiri network. As an intern, you will be given the opportunity to accumulate experience and skills necessary for the work place especially skills for banking operations. After successfully completing the Mandiri Kriya program, you will be eligible for Mandiri Education Aid, to assist you complete your graduate studies.</p>\n\n<p>This intern opportunity is specific for candidates in West Java.</p>","job_source":"kalibrr","job_url":"https://kalibrr.id/c/pt-bank-mandiri-persero-tbk/jobs/108407/kriya-mandiri-region-6-jawa-1","company":{"name":"PT Bank Mandiri (Persero) Tbk.","description":"Bank Mandiri was established on 2 October 1998, as part of the bank restructuring program of the Government of Indonesia. In July 1999, four state-owned banks - Bank Bumi Daya, Bank Dagang Negara, Bank Exim and Bapindo - were amalgamated into Bank Mandiri. The history of these four banks can be traced back to over 140 years, and together they had contributed to the beginning of the Indonesian banking sector.\n\nWe are continuously seeking mutually beneficial business opportunities that create synergies, building alliances and strengthening our supporting businesses with and through our subsidiaries, notably Mandiri Sekuritas in investment banking, AXA Mandiri Financial Services in insurance, Bank Syariah Mandiri in Sharia banking, Bank Sinar Harapan Bali in micro banking, and Mandiri Tunas Finance in multi-finance. In 2011, Bank Mandiri acquired Mandiri AXA General Insurance (MAGI), a joint-venture between Bank Mandiri and AXA Societe Anonyme, to strengthen Bank Mandiri's penetration into the general insurance business. With various subsidiaries that support our businesses, we have further strengthened our position as a prominent financial holdings institution in Indonesia.\n\n“Bank Mandiri continues to realize its commitment to human resource development through the company's work culture program, especially in this new normal era. As a result, this consistency encouraged HR Asia to win Bank Mandiri to become one of the Best Companies to Work For in 2020,” -HR Asia 2020-\n\nBank Mandiri awarded by Digital Marketing & Human Capital Awards 2020 for category The Best Overall for Corporate in Human Capital 2020 (Wholesale Banking Segment) and The Best Chief Human Capital Officer 2020 (Wholesale Banking Segment).","website":"http://www.bankmandiri.co.id/","logo":"https://rec-data.kalibrr.com/logos/VMQVWXPLJCR5XBSVLCR6TWQ8WGZ87VDZRPZQLCEE-5a4da1cb.jpg"},"tags":["Customer Service","Public Relations (PR)","Microsoft / MS Office"],"location":"5fcd2399a9754be177689021"}]